In [1]:
import pandas as pd

/usr/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
df=pd.read_csv('../examples/ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('../examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('../examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [6]:
pd.read_csv('../examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('../examples/ex2.csv',names=['a','b','c','d','Message'])

   a   b   c   d Message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_csv('../examples/ex2.csv',names=['a','b','c','d','Message'],index_col='Message')

         a   b   c   d
Message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
pd.read_csv('../examples/ex2.csv',names=['a','b','c','d','Message'],index_col=3)

    a   b   c Message
d
4   1   2   3   hello
8   5   6   7   world
12  9  10  11     foo

In [10]:
df_parsed=pd.read_csv('../examples/csv_mindex.csv',index_col=[0,1])

In [11]:
df_parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
df_ex3_table=pd.read_table('../examples/ex3.txt',sep='\s+')

In [13]:
df_ex3_table

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
df_ex3_csv=pd.read_csv('../examples/ex3.csv',delimiter='\s+')

In [15]:
df_ex3_csv

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
df_ex4=pd.read_csv('../examples/ex4.csv',skiprows=[0,2,3])

In [17]:
df_ex4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
df_ex5=pd.read_csv('../examples/ex5.csv')

In [19]:
df_ex5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isna(df_ex5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [21]:
pd.isnull(df_ex5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [22]:
pd.read_csv('../examples/ex5.csv',na_values={'message':['NA','foo'],'something':['one']})

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [23]:
pd.options.display.max_rows=10

In [24]:
pd.read_csv('../examples/ex6.csv')

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
pd.read_csv('../examples/ex6.csv',nrows=12,index_col='key')

          one       two     three      four
key
L    0.467976 -0.038649 -0.295344 -1.824726
B   -0.358893  1.404453  0.704965 -0.200638
G   -0.501840  0.659254 -0.421691 -0.057688
R    0.204886  1.074134  1.388361 -0.982404
Q    0.354628 -0.133116  0.283763 -0.837063
..        ...       ...       ...       ...
K   -0.913135  1.530624 -0.572657  0.477252
S    0.358480 -0.497572 -0.367016  0.507702
G   -1.740877 -1.160417 -1.637830  2.172201
8    0.240564 -0.328249  1.252155  1.072796
R    0.764018  1.165476 -0.639544  1.495258

[12 rows x 4 columns]

In [26]:
chunker=pd.read_csv('../examples/ex6.csv',chunksize=100)

In [27]:
tot=pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)

In [28]:
tot.sort_values(ascending=False)

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [29]:
pd.options.display.max_rows = 50

In [30]:
tot.sort_values(ascending=False)[:20]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
dtype: float64

In [31]:
tot.to_csv('test_output.csv')

In [33]:
data=pd.read_csv('../examples/ex5.csv')

In [34]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
import sys
data.to_csv(sys.stdout,sep='|',na_rep='NULL')

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout,index=False)

something,a,b,c,d,message
one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [44]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
df7_trial=pd.read_csv('../examples/ex7.csv')

In [46]:
df7_trial

   a  b  c
0  1  2  3
1  1  2  3

In [47]:
df7_readtable=pd.read_table('../examples/ex7.csv')

In [48]:
df7_readtable

   a,"b","c"
0  1,"2","3"
1  1,"2","3"

In [49]:
import csv
with open('../examples/ex7.csv') as f:
    lines=list(csv.reader(f))

In [50]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [51]:
print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [53]:
header, values = lines[0],lines[1:]

In [54]:
header

['a', 'b', 'c']

In [55]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [57]:
data_dict= {k:v for k,v in zip(header,zip(*values))}

In [58]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [60]:
list_comp=[l for l in zip(*values)]

In [61]:
list_comp

[('1', '1'), ('2', '2'), ('3', '3')]

In [62]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [64]:
list(zip(values))

[(['1', '2', '3'],), (['1', '2', '3'],)]

In [65]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [66]:
df_data_ex7=pd.DataFrame(data_dict)

In [67]:
df_data_ex7

   a  b  c
0  1  2  3
1  1  2  3

In [68]:
df_json=pd.read_json('../examples/example.json')

In [69]:
df_json

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [71]:
df_ex1_xlsx=pd.read_excel('../examples/ex1.xlsx')

In [72]:
df_ex1_xlsx

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
tot[:20]

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
dtype: float64